components/url/CategoryUrlRule.php

    public function createUrl($manager, $route, $params)
    {
        if ($route == 'category/view') {

            $path = 'category/';

            $idCategory = $params['id'];

            if ($idCategory) {
                $alias = Category::findOne($idCategory)->alias;
---
SELECT * FROM `category` WHERE `id`='22'