components/url/ProductUrlRule.php

    public function createUrl($manager, $route, $params)
    {
        if ($route == 'product/view') {

            $path = 'product/';

            $idCategory = $params['id'];

            if ($idCategory) {
                $alias = Product::findOne($idCategory)->alias;
---
SELECT * FROM `product` WHERE `id`=13