controllers/CategoryController.php

SELECT * FROM `product` WHERE `hit`='1' LIMIT 6
SELECT * FROM `product` WHERE `new`='1' LIMIT 6
---
    public function actionIndex()
    {
        $hits = Product::find()->where(['hit' => '1'])->limit(6)->all();
        $news = Product::find()->where(['new' => '1'])->limit(6)->all();

SELECT * FROM `category` WHERE `id`=22
SELECT COUNT(*) FROM `product` WHERE `category_id`=22
SELECT * FROM `product` WHERE `category_id`=22 LIMIT 9
---
    public function actionView($id)
    {

        $category = Category::findOne(['id' => $id]);

        if ($category === null) {
            throw new HttpException(404, 'not category');
        }

        $query = Product::find()->where(['category_id' => $id]);
        $pages = new Pagination([
            'totalCount' => $query->count(),
            'pageSize' => 9,
            'forcePageParam' => false,
            'pageSizeParam' => false
        ]);
        $products = $query->offset($pages->offset)->limit($pages->limit)->all();