components/MenuWidgetN.php

    public function run()
    {
        // get cache
        if ($this->tpl == 'menun.php') {
            $menu = Yii::$app->cache->get('menun');
            if ($menu) return $menu;
        }

        $this->data = Category::find()->indexBy('id')->asArray()->all();
---
SELECT * FROM `category`