<?php
use yii\helpers\Html;

/* @var $this yii\web\View */
$this->title = 'About';
$this->params['breadcrumbs'][] = $this->title;
?>
<div class="std container"><p><span style="font-size: medium;"><strong>Раді вітати Вас в нашому інтернет-магазині "ilovemommy.com.ua"</strong></span></p>
    <p><span style="font-size: medium;"><strong>Хочемо акцентувати Вашу увагу, що увесь дитячий одяг в магазині новий і оригінальний, у нас немає китайських і турецьких підробок. Ми не співпрацюємо із посередниками, а самостійно напряму вибираємо і привозимо увесь товар.</strong></span></p>
    <p><span style="font-size: medium;"><strong>Так, в нашому магазині Ви зможете купити одяг для дітей таких відомих американських брендів, як Carter's, Old Navy, Crazy8, OshKosh та інші.</strong></span></p>
    <p><span style="font-size: medium;"><strong>Зараз наш магазин радий запропонувати Вам дитячий одяг від 0 до 12 років. В одязі від "Ilovemommy", Ваші улюблені дітки будуть сучасні і яскраві, найоригінальніші і найчарівніші. Ми знаємо про наш асортимент одягу все, і із задоволенням поділимося з Вами усіма тонкощами і нюансами при виборі одягу того або іншого бренду. Каталог дитячого одягу буде регулярно поповнюватиметься.</strong></span></p>
    <p><span style="font-size: medium;"><strong>Ми будемо знайомити Вас із новинками красивого, якісного та комфортного дитячого одягу. Адже, всім батькам хочеться, щоб дитина була не тільки розумною і вихованою, а також красивою і модною.</strong></span></p>
    <p><span style="font-size: medium;"><strong>&nbsp;</strong></span></p>
    <p><span style="font-size: medium;"><strong>Інернет-магазини сьогодні являються вигідним способом купити товар за ціною, яка нижче ніж в звичайних магазинах.&nbsp;</strong></span></p>
    <p><span style="font-size: medium;"><strong>Купуючи брендовий дитячий одяг в першу чергу Ви піклуєтусь про безпеку Вашої дитини, оскільки якість одягу цих брендів перевірена поколіннями дітей протягом багатьох років. Так само Ви робите вигідну інвестицію оскільки такий одяг Ваша дитина носитиме упродовж довгого періоду часу. Інтернет магазин дитячого одягу Україна "I love mommy"&nbsp;</strong></span></p>
    <p><span style="font-size: medium;"><strong>&nbsp;</strong></span></p>
    <p><span style="font-size: medium;"><strong>Не втрачайте часу замовляйте одяг в інтернет-магазині дитячого одягу I love mommy прямо зараз.</strong></span></p>
    <div><span><strong>&nbsp;</strong></span></div></div>