models/Category.php

SELECT * FROM `category` WHERE `alias`='detskie-kurtki'
---
	public static function getIdByAlias($alias)
    {
        $aliasItem = Category::find()->where(['alias' => $alias]);
        if ($aliasItem->one())
        {
            return $aliasItem->one()->id;