models/Product.php

SELECT * FROM `product` WHERE `alias`='kurtka-gianfranco-ferre-dlya-malchika'
---
    public static function getIdByAlias($alias)
    {
        $aliasItem = Product::find()->where(['alias' => $alias]);
        if ($aliasItem->one())
        {
            return $aliasItem->one()->id;